grevaillot/svd_tools/headers/STM32H7B3x/otg2_hs_global.h
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_VBDEN USB VBUS detection enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_VBDEN		(1 << 21)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDEN Secondary detection (SD) mode enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDEN		(1 << 20)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDEN Primary detection (PD) mode enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDEN		(1 << 19)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDEN Data contact detection (DCD) mode enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDEN		(1 << 18)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_BCDEN Battery charging detector (BCD) enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_BCDEN		(1 << 17)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN Power down **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PWRDWN		(1 << 16)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_PS2DET DM pull-up detection status **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PS2DET		(1 << 3)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDET Secondary detection (SD) status **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_SDET		(1 << 2)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDET Primary detection (PD) status **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_PDET		(1 << 1)
/** OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDET Data contact detection (DCD) status **/
#define OTG2_HS_GLOBAL_OTG_HS_GCCFG_DCDET		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_global_otg_hs_cid OTGHSCID OTG_HS core ID register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_SHIFT		0
#define OTG2_HS_GLOBAL_OTG_HS_CID_PRODUCT_ID_MASK		0xffffffff
/** @defgroup otg2_hs_global_otg_hs_cid_product_id PRODUCTID Product ID field
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_global_otg_hs_glpmcfg OTGHSGLPMCFG OTG core LPM configuration register
@{*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL Enable best effort service latency **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_ENBESL		(1 << 28)

#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_SHIFT		25
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNTSTS_MASK		0x07
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_lpmrcntsts LPMRCNTSTS LPM retry count status
@{*/
/**@}*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM Send LPM transaction **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SNDLPM		(1 << 24)

#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_SHIFT		21
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRCNT_MASK		0x07
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_lpmrcnt LPMRCNT LPM retry count
@{*/
/**@}*/


#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_SHIFT		17
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMCHIDX_MASK		0x0f
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_lpmchidx LPMCHIDX LPM Channel Index
@{*/
/**@}*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK Sleep State Resume OK **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1RSMOK		(1 << 16)
/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS Port sleep status **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_SLPSTS		(1 << 15)

#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_SHIFT		13
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMRST_MASK		0x03
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_lpmrst LPMRST LPM response
@{*/
/**@}*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN L1 deep sleep enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1DSEN		(1 << 12)

#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_SHIFT		8
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESLTHRS_MASK		0x0f
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_beslthrs BESLTHRS BESL threshold
@{*/
/**@}*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN L1 Shallow Sleep enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_L1SSEN		(1 << 7)
/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE bRemoteWake value **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_REMWAKE		(1 << 6)

#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_SHIFT		2
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_BESL_MASK		0x0f
/** @defgroup otg2_hs_global_otg_hs_glpmcfg_besl BESL Best effort service latency
@{*/
/**@}*/

/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK LPM token acknowledge enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMACK		(1 << 1)
/** OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN LPM support enable **/
#define OTG2_HS_GLOBAL_OTG_HS_GLPMCFG_LPMEN		(1 << 0)

/**@}*/

/** @defgroup otg2_hs_global_otg_hs_hptxfsiz OTGHSHPTXFSIZ OTG_HS Host periodic transmit FIFO size register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_SHIFT		16
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXFD_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_hptxfsiz_ptxfd PTXFD Host periodic TxFIFO depth
@{*/
/**@}*/


#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_SHIFT		0
#define OTG2_HS_GLOBAL_OTG_HS_HPTXFSIZ_PTXSA_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_hptxfsiz_ptxsa PTXSA Host periodic TxFIFO start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_global_otg_hs_dieptxf1 OTGHSDIEPTXF1 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_SHIFT		16
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXFD_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf1_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_SHIFT		0
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF1_INEPTXSA_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf1_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_global_otg_hs_dieptxf2 OTGHSDIEPTXF2 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_SHIFT		16
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXFD_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf2_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_SHIFT		0
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF2_INEPTXSA_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf2_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_global_otg_hs_dieptxf3 OTGHSDIEPTXF3 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_SHIFT		16
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXFD_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf3_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_SHIFT		0
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF3_INEPTXSA_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf3_ineptxsa INEPTXSA IN endpoint FIFOx transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg2_hs_global_otg_hs_dieptxf4 OTGHSDIEPTXF4 OTG_HS device IN endpoint transmit FIFO size register
@{*/


#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_SHIFT		16
#define OTG2_HS_GLOBAL_OTG_HS_DIEPTXF4_INEPTXFD_MASK		0xffff
/** @defgroup otg2_hs_global_otg_hs_dieptxf4_ineptxfd INEPTXFD IN endpoint TxFIFO depth
@{*/
/**@}*/


